// 1)შექმენით ფუნქცია, რომელიც მიიღებს რიცხვების მასივს და დააბრუნებს ამ რიცხვების ჯამს

function sumArr(Arr){
    let sum = 0;
    for (let i = 0; i < numbers.length; i++) {
        sum += numbers[i];
    }
    return sum;
    }

console.log(sumArr([720, 54, 90 ,4 ,14]))


// 2)შექმენით ფუნქცია, რომელიც მიიღებს რიცხვების მასივს და დააბრუნებს მის მინიმალურ და მაქსიმალურ მნიშვნელობებს.

function minMax(numArray){
    return 
}


// 3)დაწერეთ ფუნქცია, რომელიც შექმნის N სიგრძის მასივს შემთხვევითი რიცხვებით (1-100 შუალედში).
let objects = new Array(100)

// 4)შექმენით ფუნქცია, რომელიც მიიღებს რიცხვების მასივს და დააბრუნებს ახალ მასივს, სადაც ყველა ელემენტი იქნება მისი კვადრატი.
function squared(Number){
    
}


// 5)დაწერეთ ფუნქცია, რომელიც მიიღებს რიცხვს და დააბრუნებს მის:

// Math.floor() გამოყენებით დამრგვალებულ მნიშვნელობას
// Math.ceil() გამოყენებით დამრგვალებულ მნიშვნელობას
// Math.round() გამოყენებით დამრგვალებულ მნიშვნელობას

function math(num){
    return Math.floor(num), Math.ceil(num), Math.round(num)
}