# Abstract Method

# Abstract Method-ის გამოყენებისას, თუ ჩვენ Parent Class-ს გავუწერთ რაიმე ფუნქციას, იძულებულები ვართ რომ Child Class-ებსაც გავუწეროთ ეს ფუნქციები. ეს მხოლოდ იმ შემთხვევაში თუ Parent Class-ის შექმნისას მას არგუმენტად "ABC"-ს გადავცემთ.

# polymorphism 

# Polymorphism საშუალებას გვაძლევს, რომ სხვადასხვა Child Class-ებს როდესაც ერთნაირ ფუნქციებს დავუწერთ (ძირითადად იმ ფუნქციას, რომელიც Parent Class-ს გააჩნია), ჩვენ შეგვიძლია მათ სხვადასხვა ფუნქციონალი მივანიჭოთ როგორც ფართობის მაგალითზე განვიხილეთ.

# Instance არის კლასის მეშვეობით შექმნილი ობიექტი.



# Multiple inheritance - ის დროს child კლასს შეიძლება მემკვიდრეობით გადავცეთ ერთზე მეტი parent class-ი
#  (მაგ. C(A,B))

# Multilevel inheritance - ის დროს კი child კლასი მემკვიდრეობით იღებს ისეთი parent class-დან, რომელსაც გარკვეულწილად თვითონაც გააჩნია წინაპარი კლასი, საიდანაც მემკვიდრეობით აიღო ესათუ ის მეთოდი