//  შექმენით while loop'ი რომელიც გამოიტანს კენტ რიცხვებს 1'დან 200'მდე
x = 1
while(x < 200){
    console.log(x);
    x+=2
}

//შექმენით while loop'ი რომელიც გამოიტანს 3'ის ჯერად რიცხვებს 51'დან 150'მდე
y = 51
while(y < 100){
    console.log(y)
    y+=3
}

// შექმენით for loop'ი რომელიც გამოიტანს ყველა რიცხვს 0'დან 100'მდე
for (let i = 0; i < 100; i++){
    console.log(i)
}

// შექმენით for loop'ი რომელიც გამოიტანს ყოველ მეორე რიცხვს 100'დან 300'მდე 
for (let n = 100; n < 300; n+2){
    console.log(n)
}