# Abstract Method

# Abstract Method-ის გამოყენებისას, თუ ჩვენ Parent Class-ს გავუწერთ რაიმე ფუნქციას, იძულებულები ვართ რომ Child Class-ებსაც გავუწეროთ ეს ფუნქციები. ეს მხოლოდ იმ შემთხვევაში თუ Parent Class-ის შექმნისას მას არგუმენტად "ABC"-ს გადავცემთ.

# polymorphism 

# Polymorphism საშუალებას გვაძლევს, რომ სხვადასხვა Child Class-ებს როდესაც ერთნაირ ფუნქციებს დავუწერთ (ძირითადად იმ ფუნქციას, რომელიც Parent Class-ს გააჩნია), ჩვენ შეგვიძლია მათ სხვადასხვა ფუნქციონალი მივანიჭოთ როგორც ფართობის მაგალითზე განვიხილეთ.